# MismatchPoleBrakesSlotsNumbers Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..MismatchPoleBrakesSlotsNumbers Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
The number of pole breakers may not be less than the number of occupied slots.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MismatchPoleBrakesSlotsNumbers { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MismatchPoleBrakesSlotsNumbers As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MismatchPoleBrakesSlotsNumbers {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace